backend/config/function.php

SELECT `name` FROM `alpha_role` `r` LEFT JOIN `alpha_role_user` `ra` ON r.id=ra.role_id WHERE `ra`.`user_id`='4'
---
function get_role($uid)
{
    $name=AlphaRole::find()
        ->asArray()
        ->alias('r')
        ->leftJoin(AlphaRoleUser::tableName().' AS ra', 'r.id=ra.role_id')
        ->select('name')
        ->where(['ra.user_id'=>$uid])
        ->one();

SELECT `user_login` FROM `alpha_users` WHERE `id`='1'
---
function get_users($user_id)
{
    $adminInfo = \app\models\AlphaUsers::find()
        ->select('user_login')
        ->where(['id'=>$user_id])
        ->one();