backend/service/core/AdminService.php

            $model->user_nicename = $userLogin;
            $model->user_status = !empty($postData['status']) ? $postData['status'] : AlphaUsers::STOP;
            $model->create_time = time();
            if (!$model->save()) {
---
INSERT INTO `alpha_users` (`avatar`, `user_login`, `user_pass`, `user_pass_salt`, `user_nicename`, `user_status`, `create_time`) VALUES ('', '123', '83752fd4f0aa21ae9a8c9962048bf295', 'VAfHPQERYm', '123', 1, '1528452951')

            $roleUserModel = new AlphaRoleUser();
            $roleUserModel->user_id = $model->id;
            $roleUserModel->role_id = $postData['role_id'];
            if (!$roleUserModel->save()) {
---
INSERT INTO `alpha_role_user` (`user_id`, `role_id`) VALUES (3, 25)

    public static function getOne($uid): array
    {
        $users = AlphaUsers::find()
            ->where(['id' => $uid])
            ->asArray()
            ->one();
---
SELECT * FROM `alpha_users` WHERE `id`='4'

    public static function getRoleList()
    {
        $roleList = AlphaRole::find()
            ->select('id,name')
            ->asArray()
            ->all();
---
SELECT `id`, `name` FROM `alpha_role`

    public static function edit(array $postData): bool
    {
        $flag = false;
        $db = \Yii::$app->db;
        $trans = $db->beginTransaction();
        try {
            $userPass = $postData['AlphaUsers']['user_pass'];
            $userLogin = $postData['AlphaUsers']['user_login'];
            if (empty($userLogin)) {
                throw new \Exception("账号不能为空");
            }

            if ($postData['confirm_pass'] != $userPass) {
                throw new \Exception("两次密码填写不一致");
            }
            $model = AlphaUsers::findOne($postData['id']);

            if (!empty($userPass)) {
                $randNums = random();
                $postData['AlphaUsers']['user_pass'] = encrypt_password($userPass, $randNums);
                $postData['AlphaUsers']['user_pass_salt'] = $randNums;
            }else{
                unset($postData['AlphaUsers']['user_pass']);
            }
            $model->load($postData);

            $model->user_nicename = $userLogin;
            $model->user_status = !empty($postData['status']) ? $postData['status'] : AlphaUsers::STOP;
            $model->update_time = time();
            if (!$model->save()) {
---
SELECT * FROM `alpha_users` WHERE `id`='4'
UPDATE `alpha_users` SET `user_login`='444222', `user_nicename`='444222', `update_time`='1526738499', `user_status`=1 WHERE `id`='4'

            }

            //删除之前关联的所有角色表
            AlphaRoleUser::deleteAll(['user_id' => $postData['id']]);
---
DELETE FROM `alpha_role_user` WHERE `user_id`='4'

            $roleUserModel = new AlphaRoleUser();
            $roleUserModel->user_id = $model->id;
            $roleUserModel->role_id = $postData['role_id'];
            if (!$roleUserModel->save()) {
---
INSERT INTO `alpha_role_user` (`user_id`, `role_id`) VALUES (4, 25)

    public static function editSelf($postData):bool
    {
        $flag = false;
        $db = \Yii::$app->db;
        $trans = $db->beginTransaction();
        try {
            $userPass = $postData['AlphaUsers']['user_pass'];
            $userLogin = $postData['AlphaUsers']['user_login'];
            if (empty($userLogin)) {
                throw new \Exception("账号不能为空");
            }

            if ($postData['confirm_pass'] != $userPass) {
                throw new \Exception("两次密码填写不一致");
            }
            $model = AlphaUsers::findOne($postData['id']);

            if (!empty($userPass)) {
                $randNums = random();
                $postData['AlphaUsers']['user_pass'] = encrypt_password($userPass, $randNums);
                $postData['AlphaUsers']['user_pass_salt'] = $randNums;
            }else{
                unset($postData['AlphaUsers']['user_pass']);
            }
            $model->load($postData);

            $model->user_nicename = $userLogin;
            $model->update_time = time();
            if (!$model->save()) {
---
SELECT * FROM `alpha_users` WHERE `id`='4'
UPDATE `alpha_users` SET `user_login`='4444', `user_nicename`='4444', `update_time`='1526738475' WHERE `id`='4'

    public static function del(int $id): bool
    {

        $flag = false;
        $db = \Yii::$app->db;
        $trans = $db->beginTransaction();
        try {
            AlphaUsers::deleteAll(['id' => $id]);
            AlphaRoleUser::deleteAll(['user_id' => $id]);
---
DELETE FROM `alpha_users` WHERE `id`=3
DELETE FROM `alpha_role_user` WHERE `user_id`=3