backend/service/core/AuthService.php

SELECT * FROM `alpha_users` WHERE `id`='4'
---
    public static function isLogin()
    {
        $flag = false;
        try {
            if (CookieE::hasCookie("UID")) {
                $uid = open_secret(CookieE::getCookie("UID"));
                $res=AlphaUsers::findOne($uid);