backend/service/core/InitService.php

SELECT `r`.`nav_list` FROM `alpha_users` `u` LEFT JOIN `alpha_role_user` `ra` ON ra.user_id=u.id LEFT JOIN `alpha_role` `r` ON r.id=ra.role_id WHERE `ra`.`user_id`='4'
SELECT `controller`, `method` FROM `alpha_menu` WHERE `id`='217'
---
    public static function  getNowMenuContent()
    {
        $uid = self::$uid;
        $navList = AlphaUsers::find()
            ->alias('u')
            ->asArray()
            ->leftJoin(AlphaRoleUser::tableName().' As ra', 'ra.user_id=u.id')
            ->leftJoin(AlphaRole::tableName().' As r', 'r.id=ra.role_id')
            ->where(['ra.user_id'=>$uid])
            ->select('r.nav_list')
            ->one();
        $lastMenuId = explode('-', $navList['nav_list']);
        $menuId= end($lastMenuId);
        return AlphaMenu::find()
            ->asArray()
            ->where(['id' => $menuId])
            ->select('controller,method')
            ->one();

SELECT `nav_list` FROM `alpha_users` `u` LEFT JOIN `alpha_role_user` `ra` ON ra.user_id=u.id LEFT JOIN `alpha_role` `r` ON r.id=ra.role_id WHERE `ra`.`user_id`='4'
---
    private static function menuNavList()
    {
        $name=AlphaUsers::find()
            ->asArray()
            ->alias('u')
            ->leftJoin(AlphaRoleUser::tableName().' AS ra', 'ra.user_id=u.id')
            ->leftJoin(AlphaRole::tableName().' AS r', 'r.id=ra.role_id')
            ->select('nav_list')
            ->where(['ra.user_id'=>self::$uid])
            ->one();

SELECT `user_login`, `avatar` FROM `alpha_users` WHERE `id`='4'
---
    private static function adminUserInfo()
    {
        $adminUserInfo = AlphaUsers::find()
            ->where(['id' => self::$uid])
            ->select('user_login,avatar')
            ->one();