backend/service/core/LoginService.php

SELECT `id`, `user_hits`, `user_status`, `user_pass`, `user_pass_salt` FROM `alpha_users` WHERE `user_login`='admin'
---
    public static function loginAuth(array $postData):bool
    {
        $flag = false;
        try {

            if (empty($postData['username']) || empty($postData['password'])) {
                throw new \Exception("用户名或密码不能为空");
            }
            $luosimaoOpen = Yii::$app->params['open_luosimao'];
            if ($luosimaoOpen&&YII_ENV == 'prod') {
                //生产模式
                self::authLuosimao($postData['luotest_response']);
            }
            $userInfo = AlphaUsers::find()
                ->where(['user_login'=>$postData['username']])
                ->select(['id','user_hits','user_status', 'user_pass', 'user_pass_salt'])
                ->one();