backend/service/core/MenuService.php

    public static function lists($getData): array
    {

        $menuList = AlphaMenu::find()
            ->asArray()
            ->all();
        $menuList = menu_left($menuList, 'id', 'parentid');

        $menuNum = AlphaMenu::find()->count();
---
SELECT * FROM `alpha_menu`
SELECT COUNT(*) FROM `alpha_menu`