common/helps/AuthE.php

    public function check($uid)
    {
        if (in_array($uid, $this->_config['auth_open_id']) && !empty($this->_config['auth_open_id'])) {
            //如果配置的有不需要验证的id，那么判断和该用户id是否匹配
        } else {
            if ($this->_config['auth_on']) {
                //获取当前的[模块][控制器][操作方法]
                $map = [
                    'controller' => Yii::$app->controller->id,
                    'method' => Yii::$app->controller->action->id
                ];
                $authOne = AlphaMenu::find()
                    ->where($map)
                    ->asArray()
                    ->select('id,type,name,status')
                    ->one();
                if ($authOne['type'] == 1) {
                    //该菜单是否需要验证
                    if ($authOne['status'] == 1) {
                        //只对没被禁用的菜单进行验证
                        $userStatus = AlphaUsers::find()
                            ->where(['id' => $uid])
                            ->select('user_status')
                            ->one();
---
SELECT `user_status` FROM `alpha_users` WHERE `id`='4'

    function role_rule_in($uid, $rule_id, $rule_name)
    {
        $groupAccess=AlphaRoleUser::find()
            ->where(['user_id' => $uid])
            ->asArray()
            ->one();
        $group = AlphaRole::find()
            ->where(['id' => $groupAccess['role_id']])
            ->asArray()
            ->one();
---
SELECT * FROM `alpha_role_user` WHERE `user_id`='4'
SELECT * FROM `alpha_role` WHERE `id`='25'

    function getAuthMenu($uid)
    {
        if (in_array($uid,$this->_config['auth_open_id'])){
            //超级用户id，不需要被验证，拥有所有权限
            $req = [
                'type' => AlphaMenu::ONLY_MENU,
                'status' => AlphaMenu::PASS,//没被禁用的
            ];
        } else {
            $groupAccess = AlphaRoleUser::findOne(['user_id'=>$uid]);
            $group = AlphaRole::findOne($groupAccess->role_id);
---
SELECT * FROM `alpha_role_user` WHERE `user_id`='4'
SELECT * FROM `alpha_role` WHERE `id`=25